In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("employee_data.csv")

In [7]:
df2=df.copy()
df2

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [8]:
df2.groupby("Department")["Salary"].mean()

Department
Finance      52666.666667
HR           68500.000000
IT           70666.666667
Marketing    69000.000000
Name: Salary, dtype: float64

In [11]:
df2.groupby("Department")["Salary"].agg(averge_salary="mean",max_salary="max")

            averge_salary  max_salary
Department
Finance      52666.666667       60000
HR           68500.000000       82000
IT           70666.666667       75000
Marketing    69000.000000       91000

In [16]:
df2.groupby("Department").agg({
    "Salary":"mean",
    "Age":"min"
})

                  Salary  Age
Department
Finance     52666.666667   28
HR          68500.000000   25
IT          70666.666667   32
Marketing   69000.000000   26

In [18]:
df2.groupby("Department").agg(avg_salary=("Salary","mean"),max_age=("Age","max"))

              avg_salary  max_age
Department
Finance     52666.666667       30
HR          68500.000000       41
IT          70666.666667       38
Marketing   69000.000000       45